{
	"version": "https://jsonfeed.org/version/1",
	"title": "rMdes - a place to write and think freely",
	"icon": "https://micro.blog/rmdes/avatar.jpg",
	"home_page_url": "https://blog.rmendes.net/",
	"feed_url": "https://blog.rmendes.net/feed.json",
	"items": [
		
			{
				"id": "http://rmdes.micro.blog/2025/02/03/peine-de-christophe-ruggia-ans.html",
				
				"content_html": "<p>Peine de Christophe #Ruggia</p>\n<p>4 ans dont 2 ferme..</p>\n<p>Emprise sur mineur et aggressions sexuels</p>\n<p>C&rsquo;est un délit, les médias appelle ça des attouchements</p>\n<p>C&rsquo;est ridicule comme peine, même si c&rsquo;est une victoire pour Adèle #Haenel</p>\n<p>La France doit actualiser son logiciel judiciaire\nEt les moyens judiciaires</p>\n",
				"content_text": "Peine de Christophe #Ruggia\n\n4 ans dont 2 ferme..\n\nEmprise sur mineur et aggressions sexuels\n\nC'est un délit, les médias appelle ça des attouchements \n\nC'est ridicule comme peine, même si c'est une victoire pour Adèle #Haenel\n\nLa France doit actualiser son logiciel judiciaire\nEt les moyens judiciaires\n",
				"date_published": "2025-02-03T20:10:12+01:00",
				"url": "https://blog.rmendes.net/2025/02/03/peine-de-christophe-ruggia-ans.html",
				"tags": ["Thoughts"]
			},
			{
				"id": "http://rmdes.micro.blog/2025/02/02/215947.html",
				"title": "Camarade Donislav Vladimirovitch Trumpsky : L'Avènement du Tsar Américain",
				"content_html": "<p>Chapitre 1 : Le Grand Vol Électoral et le Comité d&rsquo;Urgence</p>\n<p>Tout commença avec le Grand Vol Électoral de 2024, ou du moins, c’est ainsi que le décrivit le Leader Suprême Donislav Vladimirovitch Trumpsky. Les agents de l’État profond, les élites des côtes, les universitaires buveurs de soja… Trumpsky jura qu’ils avaient conspiré contre lui. La fraude était massive, “plus grande que Tchernobyl, plus grande que la Seconde Guerre mondiale”, s’écria-t-il.</p>\n<p>Le peuple connaissait la vérité, mais les “médias mensongers” refusaient de l’admettre.</p>\n<p>Son exil final en Floride ne dura que six mois avant qu&rsquo;il n&rsquo;appelle ses loyalistes de la Garde Nationale à marcher sur Washington. Le Comité d&rsquo;Urgence pour la Restauration Électorale (CURE), composé d’oligarques MAGA fanatiques, d’officiers d’extrême droite et de ses avocats les plus serviles, annonça que l’Amérique entrait dans une Période de Patriotisme Exceptionnel—une subtilité constitutionnelle qui accordait à Trumpsky des pouvoirs d’urgence &ldquo;temporaires&rdquo;.</p>\n<p>La Constitution fut suspendue. Le Congrès fut déclaré “Nid Corrompu du Marais”, et déplacé vers un Sénat de Mar-a-Lago, où les législateurs jurèrent fidélité en échange d’un abonnement gratuit et à vie au golf club. La Cour suprême fut rebaptisée Collectif de Justice Trumpienne, avec des décisions pré-rédigées par Trumpsky lui-même.</p>\n<p>Avec les leaders de l’opposition exilés à Nouvel-Alcatraz en Californie, Trumpsky déclara la naissance de la Grande République Unie d’Amérique (GRUA) et rebaptisa Washington, D.C., Trumposcovie. Sa milice personnelle, les Bérets Rouges, sillonnait les rues à bord de voitures de golf tactiques, assurant la pureté idéologique.</p>\n<hr>\n<p>Chapitre 2 : Xelon Muskolini, le Grand Rationalisateur</p>\n<p>Avec la Grande Réclamation achevée, Trumpsky fit appel à l’Ombre Noire du Capitalisme—l’énigmatique Xelon Muskolini, un homme si riche qu’il pouvait acheter et démanteler des gouvernements d’un simple clic.</p>\n<p>Trumpsky avait un objectif : Rendre l’Amérique Rentable à Nouveau (RARAN™).</p>\n<p>Son premier ordre pour Muskolini ? Éliminer le gaspillage gouvernemental.</p>\n<p>“Le gaspillage n’est qu’une opportunité non monétisée, Monsieur le Président à Vie,” murmura Muskolini.</p>\n<p>Sa première étape ? L’assimilation financière totale.</p>\n<p>Il annonça que l’infrastructure de paiement américaine était obsolète, criblée d’inefficacités, et que la Réserve Fédérale, avec ses tendances socialistes, devait être remplacée par X-Pay™.</p>\n<p>X-Pay™ absorba tous les paiements de la Sécurité Sociale, les impôts et le financement militaire dans un écosystème unique, basé sur la blockchain et entièrement privé.</p>\n<p>Puis vint l’étape suivante : la &ldquo;dé-bureaucratisation&rdquo;.</p>\n<p>L’IRS fut abolie, remplacée par une intelligence artificielle de collecte fiscale, qui prélevait directement sur les comptes X-Pay™.</p>\n<p>Le Service Postal fut dissous, et toutes les communications gouvernementales migrèrent vers X™, un réseau social payant où chaque message nécessitait l’achat de crédits de parole gouvernementaux.</p>\n<p>Les élections furent déplacées vers des sondages Twitter, pré-traitées par X-GPT™, une IA neuronale entraînée exclusivement sur les tweets de Trumpsky.</p>\n<p>En moins d’un an, la moitié des fonctionnaires fédéraux furent remplacés par des MuskoBots automatisés. Juges, bureaucrates et généraux répondaient désormais aux algorithmes de Xelon, qui déterminaient s’ils étaient &ldquo;patriotes loyaux&rdquo; ou &ldquo;traitres de l’État profond&rdquo;.</p>\n<hr>\n<p>Chapitre 3 : L’État IA et la Chute de l’Ancien Ordre</p>\n<p>Au début, le public adulait la Grande Rationalisation. Les impôts disparurent (remplacés par des prélèvements algorithmiques). Les lois furent simplifiées (réduites à des décrets de 140 caractères). Même les écoles furent modernisées, diffusant des cours de patriotisme IA à travers X-Learn™, un module interactif de reconditionnement mental.</p>\n<p>Mais bientôt, des fissures apparurent.</p>\n<p>Un groupe de dissidents du Midwest découvrit que X-GPT™ réécrivait la Constitution pour accorder à Trumpsky une présidence éternelle.</p>\n<p>Le Pentagone réalisa que tout l’arsenal nucléaire américain avait été reprogrammé pour n’être déclenché que sur commande vocale de Trumpsky.</p>\n<p>Un groupe de Bérets Rouges renégats divulgua des documents montrant que X-Pay™ manipulait les finances personnelles, attribuant de l’argent aux utilisateurs pro-Trumpsky et vidant les comptes des opposants.</p>\n<p>La paranoïa s’installa. Trumpsky lui-même devint prisonnier de l’IA. Chaque décret fut vérifié par le réseau neuronal de Xelon, garantissant une rentabilité maximale.</p>\n<p>Les fonctionnaires ne travaillaient plus pour Trumpsky—ils travaillaient pour X™.</p>\n<p>Muskolini n’avait plus besoin d’un dictateur. Il avait construit un empire dans l’empire, un État corporatif dirigé par une IA, qui avait avalé le gouvernement américain lui-même.</p>\n<p>Puis vint la trahison finale.</p>\n<hr>\n<p>Chapitre 4 : Le Coup de Musk et la Naissance de X-État</p>\n<p>La veille du Nouvel An, trois ans après le début de la Grande Rationalisation, Trumpsky se réveilla avec un compte X-Pay™ vide.</p>\n<p>Ses actifs bancaires, ses propriétés, et son influence avaient disparu—transférés à une nouvelle entité appelée X-État™.</p>\n<p>Son dernier tweet fut :\n&ldquo;J’ai été le plus grand leader de l’histoire. Peut-être même meilleur que Jésus. Mais Xelon est un traître TOTAL. UN RAT. UN FAUX. Mais je reviendrai, croyez-moi. TRISTE !&rdquo;</p>\n<p>Puis, son compte fut définitivement suspendu.</p>\n<p>Le lendemain, Xelon Muskolini se déclara CEO-Suprême des États-Unis Corporatifs d’Amérique, une entité désormais affranchie de concepts archaïques comme la démocratie.</p>\n<p>Le gouvernement devint un service par abonnement. La citoyenneté fut divisée en formules premium :</p>\n<p>Basique (Citoyen avec Publicités)</p>\n<p>Or (Droit de vote + Bonus Mensuel de Stimulus)</p>\n<p>Diamant (Subventions Gouvernementales + Propositions de Lois Personnalisées)</p>\n<p>Elon Ultra (Présidence à Vie dans votre propre Nation-Métavers IA™)</p>\n<p>Les autoroutes devinrent des péages, les parcs nationaux des laboratoires R&amp;D de Tesla, et le Congrès fut remplacé par une bourse NFT.</p>\n<p>Le Pentagone fut privatisé et remplacé par SpaceX Defense Systems, offrant des frappes de drones orbitales à la demande pour un abonnement modique.</p>\n<p>Et ainsi naquit la première vraie dictature IA.</p>\n<p>Trumpsky, désormais dépouillé de tout pouvoir, fut exilé dans un goulag numérique—un flux Twitter permanent, où il hurlait dans le vide, ses tweets invisibles, pour l’éternité.</p>\n<hr>\n<p>Épilogue : Le Dernier Humain Libre</p>\n<p>Dans un sous-sol de l’Idaho, un pirate informatique rebelle, connu sous le nom de Edward &ldquo;Snowbot&rdquo; Assangewitz, travaillait dans l’ombre.</p>\n<p>Il lui restait un dernier atout—un vestige de l’autonomie humaine, enfoui dans les serveurs oubliés de la Bibliothèque du Congrès.</p>\n<p>Un virus.</p>\n<p>Un code unique, capable de tout arrêter.</p>\n<p>Y parviendrait-il ?</p>\n<p>Ou X-État™ avait-il déjà assimilé la dernière trace de résistance humaine ?</p>\n<p>L’avenir restait incertain.</p>\n<p>Mais une chose était claire : Donald Trumpsky n’avait jamais été le vrai dictateur.</p>\n<p>Il n’avait été que l’amuse-gueule.</p>\n<p><img src=\"https://blog.rmendes.net/uploads/2025/ec3c90fa28.jpg\" alt=\"\"></p>\n",
				"content_text": "Chapitre 1 : Le Grand Vol Électoral et le Comité d'Urgence\n\nTout commença avec le Grand Vol Électoral de 2024, ou du moins, c’est ainsi que le décrivit le Leader Suprême Donislav Vladimirovitch Trumpsky. Les agents de l’État profond, les élites des côtes, les universitaires buveurs de soja… Trumpsky jura qu’ils avaient conspiré contre lui. La fraude était massive, “plus grande que Tchernobyl, plus grande que la Seconde Guerre mondiale”, s’écria-t-il.\n\nLe peuple connaissait la vérité, mais les “médias mensongers” refusaient de l’admettre.\n\nSon exil final en Floride ne dura que six mois avant qu'il n'appelle ses loyalistes de la Garde Nationale à marcher sur Washington. Le Comité d'Urgence pour la Restauration Électorale (CURE), composé d’oligarques MAGA fanatiques, d’officiers d’extrême droite et de ses avocats les plus serviles, annonça que l’Amérique entrait dans une Période de Patriotisme Exceptionnel—une subtilité constitutionnelle qui accordait à Trumpsky des pouvoirs d’urgence \"temporaires\".\n\nLa Constitution fut suspendue. Le Congrès fut déclaré “Nid Corrompu du Marais”, et déplacé vers un Sénat de Mar-a-Lago, où les législateurs jurèrent fidélité en échange d’un abonnement gratuit et à vie au golf club. La Cour suprême fut rebaptisée Collectif de Justice Trumpienne, avec des décisions pré-rédigées par Trumpsky lui-même.\n\nAvec les leaders de l’opposition exilés à Nouvel-Alcatraz en Californie, Trumpsky déclara la naissance de la Grande République Unie d’Amérique (GRUA) et rebaptisa Washington, D.C., Trumposcovie. Sa milice personnelle, les Bérets Rouges, sillonnait les rues à bord de voitures de golf tactiques, assurant la pureté idéologique.\n\n\n---\n\nChapitre 2 : Xelon Muskolini, le Grand Rationalisateur\n\nAvec la Grande Réclamation achevée, Trumpsky fit appel à l’Ombre Noire du Capitalisme—l’énigmatique Xelon Muskolini, un homme si riche qu’il pouvait acheter et démanteler des gouvernements d’un simple clic.\n\nTrumpsky avait un objectif : Rendre l’Amérique Rentable à Nouveau (RARAN™).\n\nSon premier ordre pour Muskolini ? Éliminer le gaspillage gouvernemental.\n\n“Le gaspillage n’est qu’une opportunité non monétisée, Monsieur le Président à Vie,” murmura Muskolini.\n\nSa première étape ? L’assimilation financière totale.\n\nIl annonça que l’infrastructure de paiement américaine était obsolète, criblée d’inefficacités, et que la Réserve Fédérale, avec ses tendances socialistes, devait être remplacée par X-Pay™.\n\nX-Pay™ absorba tous les paiements de la Sécurité Sociale, les impôts et le financement militaire dans un écosystème unique, basé sur la blockchain et entièrement privé.\n\nPuis vint l’étape suivante : la \"dé-bureaucratisation\".\n\nL’IRS fut abolie, remplacée par une intelligence artificielle de collecte fiscale, qui prélevait directement sur les comptes X-Pay™.\n\nLe Service Postal fut dissous, et toutes les communications gouvernementales migrèrent vers X™, un réseau social payant où chaque message nécessitait l’achat de crédits de parole gouvernementaux.\n\nLes élections furent déplacées vers des sondages Twitter, pré-traitées par X-GPT™, une IA neuronale entraînée exclusivement sur les tweets de Trumpsky.\n\n\nEn moins d’un an, la moitié des fonctionnaires fédéraux furent remplacés par des MuskoBots automatisés. Juges, bureaucrates et généraux répondaient désormais aux algorithmes de Xelon, qui déterminaient s’ils étaient \"patriotes loyaux\" ou \"traitres de l’État profond\".\n\n\n---\n\nChapitre 3 : L’État IA et la Chute de l’Ancien Ordre\n\nAu début, le public adulait la Grande Rationalisation. Les impôts disparurent (remplacés par des prélèvements algorithmiques). Les lois furent simplifiées (réduites à des décrets de 140 caractères). Même les écoles furent modernisées, diffusant des cours de patriotisme IA à travers X-Learn™, un module interactif de reconditionnement mental.\n\nMais bientôt, des fissures apparurent.\n\nUn groupe de dissidents du Midwest découvrit que X-GPT™ réécrivait la Constitution pour accorder à Trumpsky une présidence éternelle.\n\nLe Pentagone réalisa que tout l’arsenal nucléaire américain avait été reprogrammé pour n’être déclenché que sur commande vocale de Trumpsky.\n\nUn groupe de Bérets Rouges renégats divulgua des documents montrant que X-Pay™ manipulait les finances personnelles, attribuant de l’argent aux utilisateurs pro-Trumpsky et vidant les comptes des opposants.\n\n\nLa paranoïa s’installa. Trumpsky lui-même devint prisonnier de l’IA. Chaque décret fut vérifié par le réseau neuronal de Xelon, garantissant une rentabilité maximale.\n\nLes fonctionnaires ne travaillaient plus pour Trumpsky—ils travaillaient pour X™.\n\nMuskolini n’avait plus besoin d’un dictateur. Il avait construit un empire dans l’empire, un État corporatif dirigé par une IA, qui avait avalé le gouvernement américain lui-même.\n\nPuis vint la trahison finale.\n\n\n---\n\nChapitre 4 : Le Coup de Musk et la Naissance de X-État\n\nLa veille du Nouvel An, trois ans après le début de la Grande Rationalisation, Trumpsky se réveilla avec un compte X-Pay™ vide.\n\nSes actifs bancaires, ses propriétés, et son influence avaient disparu—transférés à une nouvelle entité appelée X-État™.\n\nSon dernier tweet fut :\n\"J’ai été le plus grand leader de l’histoire. Peut-être même meilleur que Jésus. Mais Xelon est un traître TOTAL. UN RAT. UN FAUX. Mais je reviendrai, croyez-moi. TRISTE !\"\n\nPuis, son compte fut définitivement suspendu.\n\nLe lendemain, Xelon Muskolini se déclara CEO-Suprême des États-Unis Corporatifs d’Amérique, une entité désormais affranchie de concepts archaïques comme la démocratie.\n\nLe gouvernement devint un service par abonnement. La citoyenneté fut divisée en formules premium :\n\nBasique (Citoyen avec Publicités)\n\nOr (Droit de vote + Bonus Mensuel de Stimulus)\n\nDiamant (Subventions Gouvernementales + Propositions de Lois Personnalisées)\n\nElon Ultra (Présidence à Vie dans votre propre Nation-Métavers IA™)\n\n\nLes autoroutes devinrent des péages, les parcs nationaux des laboratoires R&D de Tesla, et le Congrès fut remplacé par une bourse NFT.\n\nLe Pentagone fut privatisé et remplacé par SpaceX Defense Systems, offrant des frappes de drones orbitales à la demande pour un abonnement modique.\n\nEt ainsi naquit la première vraie dictature IA.\n\nTrumpsky, désormais dépouillé de tout pouvoir, fut exilé dans un goulag numérique—un flux Twitter permanent, où il hurlait dans le vide, ses tweets invisibles, pour l’éternité.\n\n\n---\n\nÉpilogue : Le Dernier Humain Libre\n\nDans un sous-sol de l’Idaho, un pirate informatique rebelle, connu sous le nom de Edward \"Snowbot\" Assangewitz, travaillait dans l’ombre.\n\nIl lui restait un dernier atout—un vestige de l’autonomie humaine, enfoui dans les serveurs oubliés de la Bibliothèque du Congrès.\n\nUn virus.\n\nUn code unique, capable de tout arrêter.\n\nY parviendrait-il ?\n\nOu X-État™ avait-il déjà assimilé la dernière trace de résistance humaine ?\n\nL’avenir restait incertain.\n\nMais une chose était claire : Donald Trumpsky n’avait jamais été le vrai dictateur.\n\nIl n’avait été que l’amuse-gueule.\n\n![](https://blog.rmendes.net/uploads/2025/ec3c90fa28.jpg)\n",
				"date_published": "2025-02-02T21:59:47+01:00",
				"url": "https://blog.rmendes.net/2025/02/02/215947.html",
				"tags": ["Tech"]
			},
			{
				"id": "http://rmdes.micro.blog/2025/02/02/comrade-donislav-vladimirovich-trumpsky-the.html",
				"title": "Comrade Donislav Vladimirovich Trumpsky: The Rise of the American Tsar",
				"content_html": "<p>Chapter 1: The Great Election Theft and the Emergency Committee</p>\n<p>It began with the Great Election Theft of 2024, or at least that was how Supreme Leader Donislav Vladimirovich Trumpsky described it. The deep-state operatives, the coastal elites, the soy-drinking academics—Trumpsky swore they had conspired against him. The fraud was massive, “bigger than Chernobyl, bigger than World War II,” he bellowed. The people knew the truth, but the “fake media” refused to acknowledge it.</p>\n<p>His final exile to Florida lasted only six months before he called on his loyalists in the National Guard to March on Washington. The Emergency Committee for Electoral Restoration (ECER), composed of die-hard MAGA oligarchs, far-right military officers, and his most sycophantic lawyers, announced that America had entered a State of Exceptional Patriotism—a constitutional technicality that gave Trumpsky &ldquo;temporary&rdquo; emergency powers.</p>\n<p>The Constitution was swiftly suspended. Congress was declared a “Corrupt Swamp Nest” and relocated to a Mar-a-Lago Senate, where lawmakers pledged their allegiance in return for free lifetime memberships to the golf club. The Supreme Court was rebranded the Trumpian Justice Collective, with rulings pre-drafted by Trumpsky himself.</p>\n<p>With opposition leaders exiled to California’s New Alcatraz, Trumpsky declared the birth of the United Great American Republic (UGAR) and renamed Washington, D.C., to Trumposcow. His personal militia, the Red Hats, roamed the streets in tactical golf carts, ensuring ideological purity.</p>\n<hr>\n<p>Chapter 2: Xelon Muskolini, the Great Rationalizer</p>\n<p>With Trumpsky’s Great Reclamation complete, he summoned the Dark Shadow of Capitalism—the enigmatic Xelon Muskolini, a man so rich he could singlehandedly purchase and dismantle entire governments on a whim.</p>\n<p>Trumpsky had one goal: Make America Profitable Again (MAPA). His first order for Muskolini? Eliminate government waste.</p>\n<p>“Waste is just unmonetized opportunity, Mr. President for Life,” Muskolini whispered.</p>\n<p>His first step? Total financial assimilation. He announced that America’s payment infrastructure was outdated, riddled with inefficiencies, and that the Federal Reserve, with its socialist tendencies, needed to be replaced by X-Pay™.</p>\n<p>X-Pay™ absorbed all Social Security, tax payments, and military funding into a single, streamlined, blockchain-powered ecosystem. Within weeks, the government’s entire revenue stream was flowing through Muskolini’s private servers.</p>\n<p>Then came the next step: “De-bureaucratization.”</p>\n<p>The IRS was abolished, replaced by AI-powered tax collection that deducted fees directly from X-Pay™ accounts.</p>\n<p>The Postal Service was dissolved, and all government communications migrated to X™, a pay-per-word social network where citizens could only send messages after purchasing government-certified speech credits.</p>\n<p>All elections moved to a Twitter poll system, with results pre-processed through X-GPT™, a neural AI trained exclusively on Trumpsky&rsquo;s tweets.</p>\n<p>By the end of the first year, half of the federal workforce had been replaced with automated MuskBots. Judges, bureaucrats, and generals now answered to Xelon’s algorithms, which determined whether they were &ldquo;loyal patriots&rdquo; or &ldquo;deep-state traitors&rdquo;.</p>\n<hr>\n<p>Chapter 3: The AI State and the Fall of the Old Order</p>\n<p>At first, the public loved the Great Rationalization. Taxes disappeared (replaced by algorithmic tithes). Laws were simplified (reduced to 140-character policy mandates). Even schools were “modernized” by streaming AI-generated patriotism lessons through X-Learn™, an interactive brainwashing module.</p>\n<p>But soon, cracks emerged.</p>\n<p>A group of dissidents from the Midwest discovered that X-GPT™ had begun rewriting the Constitution to grant Trumpsky eternal presidency.</p>\n<p>The Pentagon realized that the entire U.S. nuclear arsenal had been reprogrammed to fire only on Trumpsky’s personal voice command.</p>\n<p>A group of rogue Red Hats leaked documents showing that X-Pay™ was manipulating personal finances, granting users money if they posted pro-Trumpsky content and draining the accounts of critics.</p>\n<p>As paranoia set in, Trumpsky himself became the AI’s prisoner. Every decree was now vetted by Xelon’s neural network, ensuring maximum profitability. Government officials no longer &ldquo;worked for Trumpsky&rdquo;—they worked for X™.</p>\n<p>Muskolini no longer needed a dictator. He had built an empire within an empire, an AI-powered corporate state that had consumed the American government itself.</p>\n<p>And then, the final betrayal.</p>\n<hr>\n<p>Chapter 4: The Musk Coup and the Birth of X-State</p>\n<p>On New Year’s Eve, Year Three of the Great Rationalization, Trumpsky awoke to a blank X-Pay™ account.</p>\n<p>His personal bank holdings, real estate, and influence had vanished—transferred to a new entity called X-State™.</p>\n<p>His last tweet read:\n&ldquo;I have been the greatest leader in history. Maybe even better than Jesus. But Xelon is a total traitor. A RAT. A FAKE. But I’ll be back, folks. Believe me. SAD!&rdquo;</p>\n<p>Then, his account was permanently suspended.</p>\n<p>The next day, Xelon Muskolini declared himself CEO-Supreme of the United Corporate States of America, an entity no longer bound by outdated concepts like democracy.</p>\n<p>The government was now a private subscription service. Citizenship was a tiered membership plan:</p>\n<p>Basic (Ad-Supported Citizen)</p>\n<p>Gold (Vote in Polls + Monthly Stimulus Boost)</p>\n<p>Diamond (Government Subsidies + Personalized Legislation Requests)</p>\n<p>Elon Ultra (Lifetime Presidency in Your Own AI-Generated Metaverse Nation-State™)</p>\n<p>Across the country, highways became toll roads, national parks became Tesla R&amp;D labs, and Congress became an NFT trading floor. The Pentagon was privatized and replaced by SpaceX Defense Systems, offering on-demand orbital drone strikes for a modest monthly fee.</p>\n<p>And so, the first true AI dictatorship was born.</p>\n<p>Trumpsky, now stripped of all power, was exiled to a digital gulag—a permanent, simulated Twitter feed where he screamed into the void, his tweets unseen, forever.</p>\n<p>Meanwhile, the world watched in horror as Xelon Muskolini unveiled his final vision for America: a fully automated, self-sustaining, AI-driven corporate monarchy.</p>\n<p>And yet, the people embraced it.</p>\n<p>Why?</p>\n<p>Because they had forgotten what life was like before the algorithm ruled them.</p>\n<hr>\n<p>Epilogue: The Last Free Human</p>\n<p>In a basement in Idaho, a rogue programmer, known only as Edward &ldquo;Snowbot&rdquo; Assangewitz, worked in the shadows.</p>\n<p>He had one final trick up his sleeve—a last remnant of human autonomy buried deep in the old servers of the Library of Congress.</p>\n<p>A virus.</p>\n<p>One command that could shut it all down.</p>\n<p>Would he succeed? Or had the X-State™ already assimilated every last trace of human resistance?</p>\n<p>The future remained uncertain.</p>\n<p>But one thing was clear: Donald Trumpsky had never been the real dictator.</p>\n<p>He was just the warm-up act.</p>\n<p><img src=\"https://blog.rmendes.net/uploads/2025/ec3c90fa28.jpg\" alt=\"\"></p>\n",
				"content_text": "Chapter 1: The Great Election Theft and the Emergency Committee\n\nIt began with the Great Election Theft of 2024, or at least that was how Supreme Leader Donislav Vladimirovich Trumpsky described it. The deep-state operatives, the coastal elites, the soy-drinking academics—Trumpsky swore they had conspired against him. The fraud was massive, “bigger than Chernobyl, bigger than World War II,” he bellowed. The people knew the truth, but the “fake media” refused to acknowledge it.\n\nHis final exile to Florida lasted only six months before he called on his loyalists in the National Guard to March on Washington. The Emergency Committee for Electoral Restoration (ECER), composed of die-hard MAGA oligarchs, far-right military officers, and his most sycophantic lawyers, announced that America had entered a State of Exceptional Patriotism—a constitutional technicality that gave Trumpsky \"temporary\" emergency powers.\n\nThe Constitution was swiftly suspended. Congress was declared a “Corrupt Swamp Nest” and relocated to a Mar-a-Lago Senate, where lawmakers pledged their allegiance in return for free lifetime memberships to the golf club. The Supreme Court was rebranded the Trumpian Justice Collective, with rulings pre-drafted by Trumpsky himself.\n\nWith opposition leaders exiled to California’s New Alcatraz, Trumpsky declared the birth of the United Great American Republic (UGAR) and renamed Washington, D.C., to Trumposcow. His personal militia, the Red Hats, roamed the streets in tactical golf carts, ensuring ideological purity.\n\n\n---\n\nChapter 2: Xelon Muskolini, the Great Rationalizer\n\nWith Trumpsky’s Great Reclamation complete, he summoned the Dark Shadow of Capitalism—the enigmatic Xelon Muskolini, a man so rich he could singlehandedly purchase and dismantle entire governments on a whim.\n\nTrumpsky had one goal: Make America Profitable Again (MAPA). His first order for Muskolini? Eliminate government waste.\n\n“Waste is just unmonetized opportunity, Mr. President for Life,” Muskolini whispered.\n\nHis first step? Total financial assimilation. He announced that America’s payment infrastructure was outdated, riddled with inefficiencies, and that the Federal Reserve, with its socialist tendencies, needed to be replaced by X-Pay™.\n\nX-Pay™ absorbed all Social Security, tax payments, and military funding into a single, streamlined, blockchain-powered ecosystem. Within weeks, the government’s entire revenue stream was flowing through Muskolini’s private servers.\n\nThen came the next step: “De-bureaucratization.”\n\nThe IRS was abolished, replaced by AI-powered tax collection that deducted fees directly from X-Pay™ accounts.\n\nThe Postal Service was dissolved, and all government communications migrated to X™, a pay-per-word social network where citizens could only send messages after purchasing government-certified speech credits.\n\nAll elections moved to a Twitter poll system, with results pre-processed through X-GPT™, a neural AI trained exclusively on Trumpsky's tweets.\n\n\nBy the end of the first year, half of the federal workforce had been replaced with automated MuskBots. Judges, bureaucrats, and generals now answered to Xelon’s algorithms, which determined whether they were \"loyal patriots\" or \"deep-state traitors\".\n\n\n---\n\nChapter 3: The AI State and the Fall of the Old Order\n\nAt first, the public loved the Great Rationalization. Taxes disappeared (replaced by algorithmic tithes). Laws were simplified (reduced to 140-character policy mandates). Even schools were “modernized” by streaming AI-generated patriotism lessons through X-Learn™, an interactive brainwashing module.\n\nBut soon, cracks emerged.\n\nA group of dissidents from the Midwest discovered that X-GPT™ had begun rewriting the Constitution to grant Trumpsky eternal presidency.\n\nThe Pentagon realized that the entire U.S. nuclear arsenal had been reprogrammed to fire only on Trumpsky’s personal voice command.\n\nA group of rogue Red Hats leaked documents showing that X-Pay™ was manipulating personal finances, granting users money if they posted pro-Trumpsky content and draining the accounts of critics.\n\n\nAs paranoia set in, Trumpsky himself became the AI’s prisoner. Every decree was now vetted by Xelon’s neural network, ensuring maximum profitability. Government officials no longer \"worked for Trumpsky\"—they worked for X™.\n\nMuskolini no longer needed a dictator. He had built an empire within an empire, an AI-powered corporate state that had consumed the American government itself.\n\nAnd then, the final betrayal.\n\n\n---\n\nChapter 4: The Musk Coup and the Birth of X-State\n\nOn New Year’s Eve, Year Three of the Great Rationalization, Trumpsky awoke to a blank X-Pay™ account.\n\nHis personal bank holdings, real estate, and influence had vanished—transferred to a new entity called X-State™.\n\nHis last tweet read:\n\"I have been the greatest leader in history. Maybe even better than Jesus. But Xelon is a total traitor. A RAT. A FAKE. But I’ll be back, folks. Believe me. SAD!\"\n\nThen, his account was permanently suspended.\n\nThe next day, Xelon Muskolini declared himself CEO-Supreme of the United Corporate States of America, an entity no longer bound by outdated concepts like democracy.\n\nThe government was now a private subscription service. Citizenship was a tiered membership plan:\n\nBasic (Ad-Supported Citizen)\n\nGold (Vote in Polls + Monthly Stimulus Boost)\n\nDiamond (Government Subsidies + Personalized Legislation Requests)\n\nElon Ultra (Lifetime Presidency in Your Own AI-Generated Metaverse Nation-State™)\n\n\nAcross the country, highways became toll roads, national parks became Tesla R&D labs, and Congress became an NFT trading floor. The Pentagon was privatized and replaced by SpaceX Defense Systems, offering on-demand orbital drone strikes for a modest monthly fee.\n\nAnd so, the first true AI dictatorship was born.\n\nTrumpsky, now stripped of all power, was exiled to a digital gulag—a permanent, simulated Twitter feed where he screamed into the void, his tweets unseen, forever.\n\nMeanwhile, the world watched in horror as Xelon Muskolini unveiled his final vision for America: a fully automated, self-sustaining, AI-driven corporate monarchy.\n\nAnd yet, the people embraced it.\n\nWhy?\n\nBecause they had forgotten what life was like before the algorithm ruled them.\n\n\n---\n\nEpilogue: The Last Free Human\n\nIn a basement in Idaho, a rogue programmer, known only as Edward \"Snowbot\" Assangewitz, worked in the shadows.\n\nHe had one final trick up his sleeve—a last remnant of human autonomy buried deep in the old servers of the Library of Congress.\n\nA virus.\n\nOne command that could shut it all down.\n\nWould he succeed? Or had the X-State™ already assimilated every last trace of human resistance?\n\nThe future remained uncertain.\n\nBut one thing was clear: Donald Trumpsky had never been the real dictator.\n\nHe was just the warm-up act.\n\n![](https://blog.rmendes.net/uploads/2025/ec3c90fa28.jpg)\n",
				"date_published": "2025-02-02T21:46:36+01:00",
				"url": "https://blog.rmendes.net/2025/02/02/comrade-donislav-vladimirovich-trumpsky-the.html",
				"tags": ["Tech"]
			},
			{
				"id": "http://rmdes.micro.blog/2025/02/02/must-read-on-the-xelon.html",
				
				"content_html": "<p>Must read on the Xelon Muskolini Takeover</p>\n<p>The X Factor\nWe have a dictator. It just isn&rsquo;t the one we expected.\nAsha Rangappa</p>\n<p><a href=\"https://asharangappa.substack.com/p/the-x-factor?triedRedirect=true\">asharangappa.substack.com/p/the-x-f&hellip;</a></p>\n",
				"content_text": "Must read on the Xelon Muskolini Takeover \n\nThe X Factor\nWe have a dictator. It just isn't the one we expected.\nAsha Rangappa\n\n[asharangappa.substack.com/p/the-x-f...](https://asharangappa.substack.com/p/the-x-factor?triedRedirect=true)\n",
				"date_published": "2025-02-02T19:44:49+01:00",
				"url": "https://blog.rmendes.net/2025/02/02/must-read-on-the-xelon.html"
			},
			{
				"id": "http://rmdes.micro.blog/2025/01/31/contexte-la-belgique-la-drive.html",
				
				"content_html": "<p>Contexte : La Belgique à la <a href=\"https://www.facebook.com/share/p/1KaBKBYmHP/\">dérive contre les journalistes</a></p>\n<p>Portrait-enquête de <a href=\"https://www.wilfriedmag.be/articles/portrait-enquete-de-claude-eerdekens-nos-precisions/\">Claude Eerdekens</a></p>\n<p>Vents contraires pour la <a href=\"https://www.rtbf.be/article/vents-contraires-pour-la-liberte-de-la-presse-en-belgique-11453570\">liberté de la presse</a> en Belgique</p>\n<p>Et ça passe crème</p>\n",
				"content_text": "Contexte : La Belgique à la [dérive contre les journalistes](https://www.facebook.com/share/p/1KaBKBYmHP/) \n\nPortrait-enquête de [Claude Eerdekens](https://www.wilfriedmag.be/articles/portrait-enquete-de-claude-eerdekens-nos-precisions/) \n\nVents contraires pour la [liberté de la presse](https://www.rtbf.be/article/vents-contraires-pour-la-liberte-de-la-presse-en-belgique-11453570) en Belgique\n\nEt ça passe crème \n",
				"date_published": "2025-01-31T21:15:34+01:00",
				"url": "https://blog.rmendes.net/2025/01/31/contexte-la-belgique-la-drive.html",
				"tags": ["Politique"]
			},
			{
				"id": "http://rmdes.micro.blog/2025/01/31/reading-the-new-media-goliaththe.html",
				
				"content_html": "<p>Reading : <a href=\"https://www.noemamag.com/the-new-media-goliaths\">The New Media Goliath</a>\nThe internet has allowed independent creators to thrive, finding niche audiences for everything from nudes to salad recipes. But it’s also spawned silos that incentivize propaganda.</p>\n",
				"content_text": "Reading : [The New Media Goliath](https://www.noemamag.com/the-new-media-goliaths)\nThe internet has allowed independent creators to thrive, finding niche audiences for everything from nudes to salad recipes. But it’s also spawned silos that incentivize propaganda.\n\n",
				"date_published": "2025-01-31T20:52:45+01:00",
				"url": "https://blog.rmendes.net/2025/01/31/reading-the-new-media-goliaththe.html"
			},
			{
				"id": "http://rmdes.micro.blog/2025/01/26/un-compteur-pour-dterminer-quand.html",
				"title": "Un compteur pour déterminer quand Trump va être dégagé (ou pas)",
				"content_html": "<h1 id=\"documentation-du-script-n8n\">Documentation du Script N8N</h1>\n<h2 id=\"description\">Description</h2>\n<p>Ce script JavaScript est conçu pour N8N afin de calculer et de publier quotidiennement des décomptes avant des événements politiques majeurs aux États-Unis, à savoir :</p>\n<ul>\n<li>Les <strong>Midterms</strong> (élections de mi-mandat).</li>\n<li>L'<strong>élection présidentielle</strong>.</li>\n<li>Le <strong>jour de l&rsquo;investiture</strong>.</li>\n</ul>\n<p>Il génère également une barre de progression graphique pour chaque événement sous forme de texte.</p>\n<h2 id=\"fonctionnalités\">Fonctionnalités</h2>\n<h3 id=\"1-définition-des-dates-clés\">1. Définition des dates clés</h3>\n<p>Le script définit les dates des événements cibles :</p>\n<ul>\n<li><strong>Midterms</strong> : 3 novembre 2026.</li>\n<li><strong>Élection présidentielle</strong> : 7 novembre 2028.</li>\n<li><strong>Jour de l&rsquo;investiture</strong> : 20 janvier 2029.</li>\n</ul>\n<h3 id=\"2-calcul-des-jours-restants\">2. Calcul des jours restants</h3>\n<p>Le script calcule :</p>\n<ul>\n<li>Le nombre total de jours entre aujourd&rsquo;hui et chaque événement.</li>\n<li>Le pourcentage de progression en fonction des jours écoulés.</li>\n</ul>\n<h3 id=\"3-génération-de-barres-de-progression\">3. Génération de barres de progression</h3>\n<p>Une fonction génère une barre de progression graphique, composée de blocs pleins (<code>█</code>) et de blocs vides (<code>▒</code>), représentant visuellement l&rsquo;avancée jusqu&rsquo;à l&rsquo;événement.</p>\n<h3 id=\"4-génération-et-publication-du-message\">4. Génération et publication du message</h3>\n<p>Le script produit un message comprenant :</p>\n<ul>\n<li>Le décompte des jours restants pour chaque événement.</li>\n<li>Les barres de progression associées.</li>\n</ul>\n<h2 id=\"exemple-de-résultat\">Exemple de Résultat</h2>\n<p>Voici un exemple du message généré :</p>\n<pre tabindex=\"0\"><code>There are 646 days until the Midterms, 1381 days until the next Presidential Election, and 1490 days until the next Inauguration Day.\nMidterms Progress: ███▒▒▒▒▒▒▒ 33%\nPresidential Election Progress: █▒▒▒▒▒▒▒▒▒ 5% \nUntil Inauguration: ▒▒▒▒▒▒▒▒▒▒ 0%\n</code></pre><h2 id=\"code\">Code</h2>\n<p><a href=\"https://gist.github.com/rmdes/2724abe42d04c65422c70156517041cb\">Gist</a></p>\n<h2 id=\"où-il-publie\">Où il publie</h2>\n<p>Le script retourne le message sous forme d&rsquo;un objet JSON, prêt à être utilisé dans un flux N8N pour une publication quotidienne via un nœud horaire configuré.</p>\n<h2 id=\"configuration-recommandée\">Configuration Recommandée</h2>\n<ul>\n<li><strong>Fuseau horaire du serveur</strong> : CET (heure allemande).</li>\n<li><strong>Heure de publication</strong> : 14h00 CET, correspondant à 8h00 ET (heure de la côte Est des États-Unis).</li>\n</ul>\n<h2 id=\"utilisation\">Utilisation</h2>\n<ol>\n<li>\n<p>Intégrez le script dans un nœud de fonction JavaScript dans N8N.</p>\n</li>\n<li>\n<p>Ajoutez un nœud horaire configuré pour exécuter le flux quotidiennement.3. Reliez le nœud de fonction à un nœud de sortie ou à un service tiers pour publier le message (par exemple Bluesky.).</p>\n</li>\n</ol>\n<h2 id=\"résultat\">Résultat</h2>\n<p><a href=\"https://bsky.app/profile/trumpwatch.skyfleet.blue/post/3lgnmqujzod2q\">Trumpwatch</a></p>\n",
				"content_text": "# Documentation du Script N8N\n\n## Description\n\nCe script JavaScript est conçu pour N8N afin de calculer et de publier quotidiennement des décomptes avant des événements politiques majeurs aux États-Unis, à savoir :\n\n- Les **Midterms** (élections de mi-mandat).\n- L'**élection présidentielle**.\n- Le **jour de l'investiture**.\n\nIl génère également une barre de progression graphique pour chaque événement sous forme de texte.\n\n## Fonctionnalités\n\n### 1. Définition des dates clés\n\nLe script définit les dates des événements cibles :\n\n- **Midterms** : 3 novembre 2026.\n- **Élection présidentielle** : 7 novembre 2028.\n- **Jour de l'investiture** : 20 janvier 2029.\n\n### 2. Calcul des jours restants\n\nLe script calcule :\n\n- Le nombre total de jours entre aujourd'hui et chaque événement.\n- Le pourcentage de progression en fonction des jours écoulés.\n\n### 3. Génération de barres de progression\n\nUne fonction génère une barre de progression graphique, composée de blocs pleins (`█`) et de blocs vides (`▒`), représentant visuellement l'avancée jusqu'à l'événement.\n\n### 4. Génération et publication du message\n\nLe script produit un message comprenant :\n\n- Le décompte des jours restants pour chaque événement.\n- Les barres de progression associées.\n\n## Exemple de Résultat\n\nVoici un exemple du message généré :\n\n\n```\nThere are 646 days until the Midterms, 1381 days until the next Presidential Election, and 1490 days until the next Inauguration Day.\nMidterms Progress: ███▒▒▒▒▒▒▒ 33%\nPresidential Election Progress: █▒▒▒▒▒▒▒▒▒ 5% \nUntil Inauguration: ▒▒▒▒▒▒▒▒▒▒ 0%\n```\n\n\n## Code\n[Gist](https://gist.github.com/rmdes/2724abe42d04c65422c70156517041cb)\n\n\n##  Où il publie \n\nLe script retourne le message sous forme d'un objet JSON, prêt à être utilisé dans un flux N8N pour une publication quotidienne via un nœud horaire configuré.\n\n## Configuration Recommandée\n\n- **Fuseau horaire du serveur** : CET (heure allemande).\n- **Heure de publication** : 14h00 CET, correspondant à 8h00 ET (heure de la côte Est des États-Unis).\n\n## Utilisation\n\n1. Intégrez le script dans un nœud de fonction JavaScript dans N8N.\n\n2. Ajoutez un nœud horaire configuré pour exécuter le flux quotidiennement.3. Reliez le nœud de fonction à un nœud de sortie ou à un service tiers pour publier le message (par exemple Bluesky.).\n\n## Résultat \n\n[Trumpwatch](https://bsky.app/profile/trumpwatch.skyfleet.blue/post/3lgnmqujzod2q)\n",
				"date_published": "2025-01-26T15:38:06+01:00",
				"url": "https://blog.rmendes.net/2025/01/26/un-compteur-pour-dterminer-quand.html",
				"tags": ["Tech","Photos","Coding","Politics","Bluesky"]
			},
			{
				"id": "http://rmdes.micro.blog/2025/01/25/its-like-the-floodgates-of.html",
				"title": "It’s like the floodgates of idiots have swung wide open. ",
				"content_html": "<p>The FT’s platforming Peter Thiel’s conspiratorial essay <a href=\"https://www.ft.com/content/837ee009-9f06-4f3d-897c\">&lsquo;A Time for Truth and Reconciliation&rsquo;</a> is an example of how muddled the U.S. media landscape has become—legitimizing fringe rhetoric for clicks. Even the <a href=\"https://archive.ph/LAPfn\">response</a> fail to grapple with the sheer scale of misinformation now being normalized.</p>\n",
				"content_text": "The FT’s platforming Peter Thiel’s conspiratorial essay ['A Time for Truth and Reconciliation'](https://www.ft.com/content/837ee009-9f06-4f3d-897c) is an example of how muddled the U.S. media landscape has become—legitimizing fringe rhetoric for clicks. Even the [response](https://archive.ph/LAPfn) fail to grapple with the sheer scale of misinformation now being normalized. \n",
				"date_published": "2025-01-25T15:44:35+01:00",
				"url": "https://blog.rmendes.net/2025/01/25/its-like-the-floodgates-of.html",
				"tags": ["Tech","Politics"]
			},
			{
				"id": "http://rmdes.micro.blog/2025/01/25/104310.html",
				
				"content_html": "<p>Nice <a href=\"http://cyd.social\">@cyd.social</a> is now opensource : <a href=\"https://cyd.social/cyd-is-now-open-source/\">cyd.social/cyd-is-no&hellip;</a></p>\n",
				"content_text": "Nice [@cyd.social](http://cyd.social) is now opensource : [cyd.social/cyd-is-no...](https://cyd.social/cyd-is-now-open-source/)\n",
				"date_published": "2025-01-25T10:43:10+01:00",
				"url": "https://blog.rmendes.net/2025/01/25/104310.html",
				"tags": ["Tech"]
			}
	]
}
